## 4.9: Intro to Data Visualization with Python Part 1

### 3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [33]:
# Importing Libraries
import pandas as pd
import numpy as np
import os

In [34]:
# Creating Path
#path = r'C:\Users\ankit\Desktop\DataAnalysisCF\DataImmersion\PythonFundamentals\Instacart Basket Analysis'
path = r'C:\Users\pratejos\Desktop\Ankita'

In [35]:
# Importing Customer Dataframe
customer = pd.read_csv(os.path.join(path, 'customers.csv'))

In [36]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 4. Wrangle the data so that it follows consistent logic

In [38]:
 customer.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [39]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [40]:
# Changing user_id data type to String
customer['user_id'] = customer['user_id'].astype('str')

In [41]:
# Creating a dict to rename multiple columns
dict = { 'First Name': 'first_name','Gender':'gender','STATE' : 'state','Age':'age' ,'Surnam' : 'surname','fam_status':'marital_status'}

In [42]:
# Renaming Columns
customer.rename (columns = dict,  inplace = True)

In [43]:
#Checking column names
customer.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [44]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### Data Wrangling:
##### Data type of user_id is changed to string.
##### Columns names are updated successfully and are uniform and clear.
##### All coulmns are important, hence not dropping any column.

### 5.Complete the fundamental data quality and consistency checks

In [47]:
#Checking data types
customer.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [48]:
# Checking for mixed data-types in each column
for col in customer.columns.tolist():
  weird = (customer[[col]].map(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

first_name

In [49]:
# Updating first_name column data type to string as it is mixed
customer['first_name'] = customer['first_name'].astype('str')

In [50]:
# Checking data type
customer.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [51]:
for col in customer.columns.tolist():
  weird = (customer[[col]].map(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

#### No column has mixed data type

In [53]:
# Checking missing values
customer.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

#### No column has missing value

In [55]:
cust = customer[customer.duplicated()]

In [56]:
cust

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

#### No duplicate values

In [58]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 6.Combine your customer data with the rest of your prepared Instacart data.

In [60]:
#Importing Prepared Instacart Data
ords_prod_merge = pd.read_pickle(os.path.join(path, 'orders_products_merged_derived_grouped.pkl'))

In [61]:
ords_prod_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spender_type,median_prior_order,frequency
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly Busy,Regularly Busy Days,Most orders,32,Regular Customer,6.935811,Low Spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly Busy,Regularly Busy Days,Average orders,32,Regular Customer,6.935811,Low Spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest Day,Busiest Days,Average orders,5,New Customer,7.930208,Low Spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly Busy,Least Busy Days,Most orders,3,New Customer,4.972414,Low Spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least Busy,Least Busy Days,Average orders,3,New Customer,4.972414,Low Spender,9.0,Frequent customer

In [62]:
# Both dataframes have the 'user_id' column
# Check data-type of shared column
ords_prod_merge.dtypes['user_id']

dtype('int64')

In [63]:
customer.dtypes['user_id']

dtype('O')

In [64]:
# Updating user_id column data type in ords_prod_merge dataframe
ords_prod_merge['user_id'] = ords_prod_merge['user_id'].astype('str')

In [65]:
#Checking updated data type
ords_prod_merge.dtypes['user_id']

dtype('O')

In [66]:
#Checking Columns
ords_prod_merge.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'mean_price', 'spender_type', 'median_prior_order',
       'frequency'],
      dtype='object')

In [67]:
# Dropping _merge column from existing dataframe
ords_prod_merge = ords_prod_merge.drop(columns=['_merge'])

In [68]:
ords_prod_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 object
 7   order_number            int64
 8   order_day_of_week       int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int64
 13  reordered               int64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  mean_price              float64
 21  spender_type            object
 22  median_prior_order      float64
 23  frequency               object
dtypes: bool(1), float64(4), int64(10), object(9)
memory usage: 5.6+ GB

In [69]:
# Changing Data type of columns to fix memory issue
ords_prod_merge['order_id']=ords_prod_merge['order_id'].astype('int32')
ords_prod_merge['user_id'] = ords_prod_merge['user_id'].astype('int32')
ords_prod_merge['order_number']=ords_prod_merge['order_number'].astype('int8')
ords_prod_merge['order_day_of_week']=ords_prod_merge['order_day_of_week'].astype('int8')
ords_prod_merge['order_hour_of_day']=ords_prod_merge['order_hour_of_day'].astype('int8')
ords_prod_merge['days_since_prior_order']=ords_prod_merge['days_since_prior_order'].astype('float16')
ords_prod_merge['product_id'] =ords_prod_merge['product_id'].astype('int32')
ords_prod_merge['reordered']=ords_prod_merge['reordered'].astype('int8')
ords_prod_merge['add_to_cart_order']=ords_prod_merge['add_to_cart_order'].astype('int32')
ords_prod_merge['aisle_id'] = ords_prod_merge['aisle_id'].astype('int8')
ords_prod_merge['department_id'] = ords_prod_merge['department_id'].astype('int8')
ords_prod_merge['prices'] = ords_prod_merge['prices'].astype('float16')
ords_prod_merge['mean_price'] = ords_prod_merge['mean_price'].astype('float16')
ords_prod_merge['max_order'] = ords_prod_merge['max_order'].astype('int32')
ords_prod_merge['median_prior_order']=ords_prod_merge['median_prior_order'].astype('float16')

C:\Users\pratejos\AppData\Local\anaconda3\Lib\site-packages\pandas\core\dtypes\astype.py:133: RuntimeWarning: overflow encountered in cast
  return arr.astype(dtype, copy=True)

In [70]:
ords_prod_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int32
 1   product_name            object
 2   aisle_id                int8
 3   department_id           int8
 4   prices                  float16
 5   order_id                int32
 6   user_id                 int32
 7   order_number            int8
 8   order_day_of_week       int8
 9   order_hour_of_day       int8
 10  days_since_prior_order  float16
 11  first_order             bool
 12  add_to_cart_order       int32
 13  reordered               int8
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int32
 19  loyalty_flag            object
 20  mean_price              float16
 21  spender_type            object
 22  median_prior_order      float16
 23  frequency               object
dtypes: bool(1), float16(4), int32(5), int8(6), object(8)
memory usage: 3.0+ GB

In [71]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(3), object(7)
memory usage: 15.7+ MB

In [72]:
# Changing Data type of columns to fix memory issue
customer['age']=customer['age'].astype('int32')
customer['n_dependants'] = customer['n_dependants'].astype('int32')
customer['income'] = customer['income'].astype('int32')
customer['user_id'] = customer['user_id'].astype('int32')

In [73]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int32
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int32
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(4), object(6)
memory usage: 12.6+ MB

In [74]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [75]:
ords_prod_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spender_type,median_prior_order,frequency
0,1,Chocolate Sandwich Cookies,61,19,5.800781,3139998,138,28,6,11,...,Mid-range product,Regularly Busy,Regularly Busy Days,Most orders,32,Regular Customer,6.937500,Low Spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.800781,1977647,138,30,6,17,...,Mid-range product,Regularly Busy,Regularly Busy Days,Average orders,32,Regular Customer,6.937500,Low Spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.800781,389851,709,2,0,21,...,Mid-range product,Busiest Day,Busiest Days,Average orders,5,New Customer,7.929688,Low Spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.800781,652770,764,1,3,13,...,Mid-range product,Regularly Busy,Least Busy Days,Most orders,3,New Customer,4.972656,Low Spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.800781,1813452,764,3,4,17,...,Mid-range product,Least Busy,Least Busy Days,Average orders,3,New Customer,4.972656,Low Spender,9.0,Frequent customer

In [76]:
# Merging datasets on user_id using default (inner) join
ords_prods_cust = ords_prod_merge.merge (customer , on = 'user_id',indicator = True )

In [77]:
ords_prods_cust['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [78]:
ords_prods_cust.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.800781,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.800781,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.800781,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.800781,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.800781,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [79]:
# Check shape of newly merged dataframe
ords_prods_cust.shape

(32404859, 34)

In [80]:
ords_prods_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 34 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int32
 1   product_name            object
 2   aisle_id                int8
 3   department_id           int8
 4   prices                  float16
 5   order_id                int32
 6   user_id                 int32
 7   order_number            int8
 8   order_day_of_week       int8
 9   order_hour_of_day       int8
 10  days_since_prior_order  float16
 11  first_order             bool
 12  add_to_cart_order       int32
 13  reordered               int8
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int32
 19  loyalty_flag            object
 20  mean_price              float16
 21  spender_type            object
 22  median_prior_order      float16
 23  frequency               object
 24  first_name              object
 25  surname                 object
 26  gender                  object
 27  state                   object
 28  age                     int32
 29  date_joined             object
 30  n_dependants            int32
 31  marital_status          object
 32  income                  int32
 33  _merge                  category
dtypes: bool(1), category(1), float16(4), int32(8), int8(6), object(14)
memory usage: 4.8+ GB

#### 8.Export this new dataframe as a pickle file

In [82]:
# Changing Data type of columns to fix error in Task 4.10 issue
ords_prods_cust['prices'] = ords_prods_cust['prices'].astype('float32')
ords_prods_cust['days_since_prior_order'] = ords_prods_cust['days_since_prior_order'].astype('float32')

In [83]:
#Cleaning Data
ords_prods_cust.loc[ords_prods_cust['prices'] >100, 'prices'] = np.nan

In [ ]:
ords_prods_cust.to_pickle(os.path.join(path,'ords_prods_cust.pkl'))